import os
from dotenv import load_dotenv
import chatgpt
from pathlib import Path
import requests

dir = Path(__file__).parent # 親フォルダを取得

DATA = {
    "011000": "稚内",
    "012010": "旭川",
    "012020": "留萌",
    "013010": "網走",
    "013020": "北見",
    "013030": "紋別",
    "014010": "根室",
    "014020": "釧路",
    "014030": "帯広",
    "015010": "室蘭",
    "015020": "浦河",
    "016010": "札幌",
    "016020": "岩見沢",
    "016030": "倶知安",
    "017010": "函館",
    "017020": "江差",
    "020010": "青森",
    "020020": "むつ",
    "020030": "八戸",
    "030010": "盛岡",
    "030020": "宮古",
    "030030": "大船渡",
    "040010": "仙台",
    "040020": "白石",
    "050010": "秋田",
    "050020": "横手",
    "060010": "山形",
    "060020": "米沢",
    "060030": "酒田",
    "060040": "新庄",
    "070010": "福島",
    "070020": "小名浜",
    "070030": "若松",
    "080010": "水戸",
    "080020": "土浦",
    "090010": "宇都宮",
    "090020": "大田原",
    "100010": "前橋",
    "100020": "みなかみ",
    "110010": "さいたま",
    "110020": "熊谷",
    "110030": "秩父",
    "120010": "千葉",
    "120020": "銚子",
    "120030": "館山",
    "130010": "東京",
    "130020": "大島",
    "130030": "八丈島",
    "130040": "父島",
    "140010": "横浜",
    "140020": "小田原",
    "150010": "新潟",
    "150020": "長岡",
    "150030": "高田",
    "150040": "相川",
    "160010": "富山",
    "160020": "伏木",
    "170010": "金沢",
    "170020": "輪島",
    "180010": "福井",
    "180020": "敦賀",
    "190010": "甲府",
    "190020": "河口湖",
    "200010": "長野",
    "200020": "松本",
    "200030": "飯田",
    "210010": "岐阜",
    "210020": "高山",
    "220010": "静岡",
    "220020": "網代",
    "220030": "三島",
    "220040": "浜松",
    "230010": "名古屋",
    "230020": "豊橋",
    "240010": "津",
    "240020": "尾鷲",
    "250010": "大津",
    "250020": "彦根",
    "260010": "京都",
    "260020": "舞鶴",
    "270000": "大阪",
    "280010": "神戸",
    "280020": "豊岡",
    "290010": "奈良",
    "290020": "風屋",
    "300010": "和歌山",
    "300020": "潮岬",
    "310010": "鳥取",
    "310020": "米子",
    "320010": "松江",
    "320020": "浜田",
    "320030": "西郷",
    "330010": "岡山",
    "330020": "津山",
    "340010": "広島",
    "340020": "庄原",
    "350010": "下関",
    "350020": "山口",
    "350030": "柳井",
    "350040": "萩",
    "360010": "徳島",
    "360020": "日和佐",
    "370000": "高松",
    "380010": "松山",
    "380020": "新居浜",
    "380030": "宇和島",
    "390010": "高知",
    "390020": "室戸岬",
    "390030": "清水",
    "400010": "福岡",
    "400020": "八幡",
    "400030": "飯塚",
    "400040": "久留米",
    "410010": "佐賀",
    "410020": "伊万里",
    "420010": "長崎",
    "420020": "佐世保",
    "420030": "厳原",
    "420040": "福江",
    "430010": "熊本",
    "430020": "阿蘇乙姫",
    "430030": "牛深",
    "430040": "人吉",
    "440010": "大分",
    "440020": "中津",
    "440030": "日田",
    "440040": "佐伯",
    "450010": "宮崎",
    "450020": "延岡",
    "450030": "都城",
    "450040": "高千穂",
    "460010": "鹿児島",
    "460020": "鹿屋",
    "460030": "種子島",
    "460040": "名瀬",
    "471010": "那覇",
    "471020": "名護",
    "471030": "久米島",
    "472000": "南大東",
    "473000": "宮古島",
    "474010": "石垣島",
    "474020": "与那国島"
}




load_dotenv(f"{dir}/.env")
chatbot = chatgpt.ChatBot(api_key = os.environ.get("OPENAI_API_KEY"))

with open(f"{dir}/system_setting.txt", "r", encoding="utf-8") as f:
    system_setting = f.read()

chatbot.set_system_setting(system_setting) #ChatGPTに最初の命令文を設定する

while True:
    while True:
        prompt = input("お住いの地域を入力してください：")
        message = chatbot.chat("地名：" + prompt)
        if message == "0":
            print("該当する地名が日本国内に存在しません。もう一度入力しなおしてください。")
        else:
            break


    url = f"https://weather.tsukumijima.net/api/forecast/city/{message}"

    try: 
        data = requests.get(url).json() # json形式でデータを取得する
        #print(data)

        print("=" * 40)
        print(f"{DATA[message]} の天気予報をお伝えします")
        print("-" * 40)
        for forecast in data['forecasts']:
            date_label = forecast['dateLabel']       # 今日、明日など
            date = forecast['date']                  # 日付
            weather = forecast['detail']['weather']  # 天気の詳細
            wind = forecast['detail']['wind']        # 風
            temp_min = forecast['temperature']['min']['celsius']
            temp_max = forecast['temperature']['max']['celsius']
            rain = forecast['chanceOfRain']          # 時間帯ごとの降水確率

            print(f"{date_label}（{date}）の天気予報：")
            print(f"  天気　　：{weather}")
            print(f"  風　　　：{wind}")
            print(f"  最高気温：{temp_max if temp_max else '--'} 度")
            print(f"  最低気温：{temp_min if temp_min else '--'} 度")
            print(f"  降水確率：")

            for time_range, prob in rain.items(): #
                print(f"    {time_range.replace('T', '').replace('_', '～')} (時)：{prob}")
            print("-" * 40)



        break
    except Exception as e:
        print(f"想定外のエラーが発生しました。 {e}\nもう一度適切な地名を入力してください。")



print("プログラム終了")